Table of Contents
 Class ExposureClassesDataEc2
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Exposure Classes Ec2
public class ExposureClassesDataEc2
Inheritance
object
ExposureClassesDataEc2
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ExposureClassesDataEc2()
Constructor
public ExposureClassesDataEc2()
Properties
 Carbonation
Combo box Carbonation
public ExposureClassEc2 Carbonation { get; set; }
Property Value
ExposureClassEc2
 CarbonationCheck
Check box Carbonation
public bool CarbonationCheck { get; set; }
Property Value
bool
 ChemicalAttack
Combo box Chemical Attack
public ExposureClassEc2 ChemicalAttack { get; set; }
Property Value
ExposureClassEc2
 ChemicalAttackCheck
Check box Chemical Attack
public bool ChemicalAttackCheck { get; set; }
Property Value
bool
 Chlorides
Combo box Chlorides
public ExposureClassEc2 Chlorides { get; set; }
Property Value
ExposureClassEc2
 ChloridesCheck
Check box Chlorides
public bool ChloridesCheck { get; set; }
Property Value
bool
 ChloridesFromSea
Combo box Chlorides from sea
public ExposureClassEc2 ChloridesFromSea { get; set; }
Property Value
ExposureClassEc2
 ChloridesFromSeaCheck
Check box Chlorides from sea
public bool ChloridesFromSeaCheck { get; set; }
Property Value
bool
 FreezeAttack
Combo box Freeze/Thaw Attack
public ExposureClassEc2 FreezeAttack { get; set; }
Property Value
ExposureClassEc2
 FreezeAttackCheck
Check box Freeze/Thaw Attack
public bool FreezeAttackCheck { get; set; }
Property Value
bool
 NoCorrosionCheck
Check box No corrosion
public bool NoCorrosionCheck { get; set; }
Property Value
bool
 Edit this page